Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: quad = love.graphics.newQuad( x, y, width, height, sw, sh )
pt_br: quad = love.graphics.newQuad( x, y, largura, altura, ls, as )

source: How many bytes have been read
pt_br: Quantidade de bytes lidos

source: A [[File]] with the font.
pt_br: Um [[File (Português)|Arquivo]] contendo a fonte.

source: device
pt_br: aparelho

source: The arc is drawn clockwise if the final angle is numerically bigger than the starting angle.
pt_br: Se o ângulo final é numericamente maior que o ângulo inicial, o arco é desenhado em sentido horário.

source: The alpha component (0-255).
pt_br: A componente alfa (0-255).

source: The width of the line.
pt_br: A espessura da linha.

source: A Shader contains either vertex shader code, pixel shader code, or both.
pt_br: Um Shader contém código de shader de vértice, código de shader de pixel, ou ambos.

source: * [[love.graphics.setColorMode]]
pt_br: * [[love.graphics.setColorMode (Português)|love.graphics.setColorMode]]

source: Effect Language
pt_br: Linguagem do Efeito

source: Gets the max supported width or height of [[Image]]s and [[Canvas]]es.
pt_br: Obtém a largura ou altura máxima suportada de [[Image (Português)|Imagens]] e [[Canvas (Português)|Pinturas]].

source: * [[love.graphics.setLineStyle]]
pt_br: * [[love.graphics.setLineStyle (Português)|love.graphics.setLineStyle]]
